tutorials/viscoelasticFluidFoam/FENE-CR/0/U
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "FENE-CR";
    instance        "";
    local           "";

    class           volVectorField;
    object          U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    patch3
    {
        type            fixedValue;
        value           uniform (5 0 0);
    }

    patch2
    {
        type            zeroGradient;
    }

    patch1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    patch0
    {
        type            empty;
    }

}


// ************************************************************************* //
