tutorials/viscoelasticFluidFoam/FENE-CR/0/tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1-dev                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/jovani/jovaniFoam/foamNewSolver/cases/recentCases/upwind";
    case "FENE-CR";
    instance "0";
    local "";

    class volSymmTensorField;
    object tau;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    patch3
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    patch2
    {
        type            zeroGradient;
    }
    patch1
    {
        type            zeroGradient;
    }

    patch0
    {
        type            empty;
    }


}


// ************************************************************************* //
